artillery.yml
config:
  target: 'http://localhost:3004/api/restaurants'
  http:
    # Responses have to be sent within 10 seconds or the request will be aborted
    timeout: 5
    pool: 6 # All HTTP requests from all virtual users will be sent over the same 8 connections
  phases:
    - duration: 2
      arrivalRate: 5
      name: "Warm up the application"
    - duration: 5
      arrivalRate: 10
      name: "First Increase"
    - duration: 60
      arrivalRate: 40
      name: "Maximum Load"
  processor: "./server/stress-test/functions.js"
scenarios:
  - name: "Go to cached ID"
    weight: 8
    flow:
    - function: "cachedRecommendations"
    - loop:
      - get:
          url: "/{{ id }}/recommendations"
      count: 50
  - name: "Go to non cached"
    weight: 2
    flow: 
    - function: "nonCachedRecommendations"
    - loop:
      - get:
          url: "/{{ id }}/recommendations"
      count: 50